#+TITLE: Kapitel 15: Von dynamischen zu statischen Typen 
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{15}

*** Implizit 

- Implizite Type casts haben allerdings kaum Sinn
  - Lediglich bei numerischen Typen zwischen floats und ints 
- Und generell: /explicit is better than implicit/ 

#+BEGIN_SRC python :exports both :results output
print(type(5 + 6.5))
#+END_SRC 

#+RESULTS:
: <class 'float'>



